# Дан список:
# ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
# Необходимо его обработать — обособить каждое целое число (вещественные не трогаем) кавычками
# (добавить кавычку до и кавычку после элемента списка, являющегося числом) и дополнить нулём до двух целочисленных разрядов:
# ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']
# Сформировать из обработанного списка строку:
# в "05" часов "17" минут температура воздуха была "+05" градусов
# Подумать, какое условие записать, чтобы выявить числа среди элементов списка? Как модифицировать это условие для чисел со знаком?
# Примечание: если обособление чисел кавычками не будет получаться - можете вернуться к его реализации позже. Главное: дополнить числа до двух разрядов нулём!
# 3. * (вместо задачи 2) Решить задачу 2 не создавая новый список (как говорят, in place). Эта задача намного серьёзнее, чем может сначала показаться.

my_list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']

count = 0
sentens = ''
while count < len(my_list):
    if my_list[count].isdigit():
        my_list[count] = str('{0:02d}'.format(int(my_list[count])))
        my_list.insert(count, '"')
        my_list.insert(count+2, '"')
        count = count + 2
    elif (my_list[count][0] == '+' and my_list[count][1:].isdigit()) or (my_list[count][0] == '-' and my_list[count][1:].isdigit()):
        my_list[count] = my_list[count][0] + str('{0:02d}'.format(int(my_list[count])))
        my_list.insert(count, '"')
        my_list.insert(count + 2, '"')
        count = count + 2
    else:
        count = count + 1
print(my_list)

for i in my_list:
    sentens = sentens + i + ' '

print(sentens)
